use std::io::{ stdin };

fn main() {

    // ループの判定フラグ
    let mut answer = String::from("2");

    while answer == "2" {




        // ここに買い物の処理を入れる //







        // 買い物をやめるかどうかの処理
        println!(" ┌──────────────────────────────────────────────────┐");
        println!(" |                                                  |");
        println!(" | 店主: 買い物をやめるかい？                       |");
        println!(" |                                                  |");
        println!(" └──────────────────────────────────────────────────┘");
        println!("\n");
        println!(" ┌──────────────────────────────────────────────────┐");
        println!(" | 自分: ふむ、どうしようか？                       |");
        println!(" | 1: > はい。もう十分ですよ。                      |");
        println!(" | 2: > いいえ！！まだですね。                      |");
        println!(" └──────────────────────────────────────────────────┘");
        let mut input = String::from("");
        stdin().read_line(&mut input).ok();
        let result = input.trim().to_string();  

        println!("\n");
        // 終了メッセージを表示しつつ分岐
        if result == "1" {
            // ループの終了
            answer = String::from("1");
            println!(" ┌──────────────────────────────────────────────────┐");
            println!(" |                                                  |");
            println!(" | 店主: おう！また来てくんな！                     |");
            println!(" |                                                  |");
            println!(" └──────────────────────────────────────────────────┘");
        } else if result == "2" {
            // 再ループ
            println!(" ┌──────────────────────────────────────────────────┐");
            println!(" |                                                  |");
            println!(" | 店主: そうかい。。色々取り揃えてるぜ。            |");
            println!(" |                                                  |");
            println!(" └──────────────────────────────────────────────────┘");
        } else {
            // 想定外の選択肢の場合
            println!(" ┌──────────────────────────────────────────────────┐");
            println!(" |                                                  |");
            println!(" | 店主: おっと、その選択肢は無しだぜ！             |");
            println!(" |                                                  |");
            println!(" └──────────────────────────────────────────────────┘");
        }

        println!("\n");

    }

}
